Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: As much processing as possible is done at build time; thus, your application only contains the classes used at runtime. In traditional frameworks, all the classes required to perform the initial application deployment hang around for the application’s life, even though they are only used once. With Quarkus, they are not even loaded into the production JVM! Quarkus does not stop here. During the build-time processing, it prepares the initialization of all components used by your application. It results in less memory usage and faster startup time as all metadata processing has already been done.
ja_jp: 可能な限り多くの処理がビルド時に行われるため、アプリケーションには実行時に使用されるクラスしか含まれません。従来のフレームワークでは、初期アプリケーションのデプロイメントを実行するために必要なすべてのクラスは、一度しか使用されないにもかかわらず、アプリケーションの寿命が尽きるまで放置されます。Quarkus では、これらのクラスはプロダクション JVM にすらロードされません。Quarkus はそこで終わりません。ビルド時の処理中に、アプリケーションで使用されるすべてのコンポーネントの初期化を準備します。これにより、すべてのメタデータ処理がすでに完了しているため、メモリー使用量が少なくなり、起動時間が短縮されます。

source: As noted above, the guarantees (of eventual consistency) required by the https://download.eclipse.org/microprofile/microprofile-lra-1.0-M1/microprofile-lra-spec.html[LRA specification] rely on the presence of a JAX-RS application that coordinates the services participating in the LRA. This component must be present when starting the interaction, when joining the interaction and when ending the interaction. If the coordinator becomes unavailable it should be restarted. Similarly, services participating in the LRA must be available during the end phase; the system will continue retrying a service until it indicates that it is finished with the LRA, and once a service has indicated successful compensation (or completion) it no longer takes part in the interaction (although it can register for a reliable notification that all services have finished compensating or completing). Although there can be many coordinators, at the time of writing, only one can manage a particular LRA.
ja_jp: 上述のように、 link:https://download.eclipse.org/microprofile/microprofile-lra-1.0-M1/microprofile-lra-spec.html[LRA仕様]が要求する（最終的な一貫性の）保証は、LRAに参加するサービスを調整するJAX-RSアプリケーションの存在に依存しています。このコンポーネントは、インタラクションの開始時、インタラクションへの参加時、およびインタラクションの終了時に存在しなければなりません。コーディネーターが利用できなくなった場合は、再起動する必要があります。同様に、LRAに参加しているサービスは、終了段階でも利用可能でなければなりません。システムは、サービスがLRAを終了したことを示すまで再試行を続け、サービスが補償（または完了）に成功したことを示すと、そのサービスはもはや相互作用に参加しません（ただし、すべてのサービスの補償または完了が終了したことを示す信頼性の高い通知に登録することは可能です）。コーディネーターは多数存在しますが、本稿執筆時点では、特定のLRAを管理できるのは1人だけです。

source: As of 2.0.2.Final, you should specify the groupId, artifactId and version using group:artifactId:version coordinate syntax directly on the command line. You can selectively omit segments to use default values:
ja_jp: 2.0.2.Final 以降、コマンドラインで直接 group:artifactId:version 座標構文を使用して、groupId、artifactId、およびバージョンを指定する必要があります。セグメントを選択的に省略して、デフォルト値を使用することができます。

source: As of OpenShift 4.14, the https://access.redhat.com/articles/7041372[`DeploymentConfig` object has been deprecated].
ja_jp: OpenShift 4.14 で、 link:https://access.redhat.com/articles/7041372[DeploymentConfig オブジェクトは非推奨] になりました。

source: As of Quarkus 2.0.0.Final, in addition to the monolithic `io.quarkus:quarkus-universe-bom`, we also define a number of platform-member-specific BOMs, e.g.
ja_jp: Quarkus 2.0.0.Finalでは、モノリシックな `io.quarkus:quarkus-universe-bom` に加えて、いくつかのプラットフォームメンバー固有のBOMを定義しています。例 :

source: As of Quarkus 2.5.0.Final, Quarkus gRPC and the Quarkus Reactive REST Client can use Stork to handle the discovery and the selection of the services.
ja_jp: Quarkus 2.5.0.Finalでは、Quarkus gRPCとQuarkus Reactive REST ClientがStorkを使用してサービスディスカバリーと選択を行うことができます。

source: As of the 2.1.0.Final release, the Quarkus CLI uses this registry to resolve the Quarkus platform used by your project.
ja_jp: 2.1.0.Finalリリースの時点で、Quarkus CLIはこのレジストリを使用して、プロジェクトで使用されているQuarkusプラットフォームを解決します。

source: As of today, it is not possible to use virtual threads in a carefree manner. Following such a laissez-faire approach could quickly lead to memory and resource starvation issues. Thus, Quarkus uses an explicit model until the aforementioned issues disappear (as the Java ecosystem matures). It is also the reason why _reactive_ extensions have the virtual thread support, and rarely the _classic_ ones. We need to know when to dispatch on a virtual thread.
ja_jp: 現在のところ、仮想スレッドを自由に使うことはできません。 このような自由放任のアプローチをとると、すぐにメモリやリソースの枯渇という問題が発生します。 そのため Quarkus では、前述の問題がなくなるまで (Javaエコシステムが成熟するまで) 明示的なモデルを使用します。 _リアクティブ_ エクステンションが仮想スレッドをサポートし、_古典的な_ スレッドをほとんどサポートしない理由もここにあります。 仮想スレッドでディスパッチするタイミングを知る必要があります。

source: As of {openshift} 4.14, the `DeploymentConfig` object is deprecated. `Deployment` is now the default and preferred deployment kind for the `quarkus-openshift` extension.
ja_jp: {openshift} 4.14 で、 `DeploymentConfig` オブジェクトは非推奨となりました。 `Deployment` は、 `quarkus-openshift` エクステンションのデフォルトかつ優先的なデプロイメント種類となりました。

source: As our platform evolved and the complexity increased, our developer process was becoming more of a chore and dependencies between technology teams, front-end, back-end, and operations, started to become a bottleneck.
ja_jp: プラットフォームが進化し、複雑さが増すにつれ、開発者のプロセスが雑になり、フロントエンド、バックエンド、オペレーションなどの技術チーム間の依存関係がボトルネックになり始めました。

source: As our project contains multiple function, we need to specify which function needs to be deployed via the following property inside our `application.properties` :
ja_jp: プロジェクトには複数の関数が含まれているので、どの関数を、 `application.properties` 内の以下のプロパティーからデプロイする必要があるかを指定する必要があります。

source: As our project contains multiple functions, we need to specify which function needs to be deployed via the following property inside our `application.properties` :
ja_jp: プロジェクトには複数の関数が含まれているので、どの関数をデプロイする必要があるかを `application.properties` 内の以下のプロパティーから指定する必要があります:

source: As part of reading the multipart body, Quarkus REST invokes the proper MessageBodyReaderlink:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] for each part of the request. If an `IOException` occurs for one of these parts (for example if Jackson was unable to deserialize a JSON part), then a `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` is thrown. If this exception is not handled by the application as mentioned in <<exception-mapping>>, an HTTP 400 response is returned by default.
ja_jp: マルチパートボディの読み取りの一環として、Quarkus REST はリクエストの各部分に対して適切な MessageBodyReaderlink:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] を呼び出します。 これらのパーツのいずれかで `IOException` が発生した場合 (たとえば、Jackson が JSON パーツをデシリアライズできなかった場合)、 `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` が出力されます。 <<exception-mapping>> に記載されているように、この例外がアプリケーションによって処理されない場合、デフォルトで HTTP 400 応答が返されます。

source: As part of reading the multipart body, RESTEasy Reactive invokes the proper MessageBodyReaderlink:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] for each part of the request. If an `IOException` occurs for one of these parts (for example if Jackson was unable to deserialize a JSON part), then a `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` is thrown. If this exception is not handled by the application as mentioned in xref:exception-mapping[Exception mapping], an HTTP 400 response is returned by default.
ja_jp: マルチパート・ボディの読み取りの一部として、RESTEasy Reactiveは適切なMessageBodyReaderを呼び出します。 link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[MessageBodyReader] をリクエストの各パートに対して作成します。これらのパートの1つに対して `IOException` が発生した場合（たとえば、Jackson が JSON 部分をデシリアライズできなかった場合）、 `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` がスローされます。この例外が xref:exception-mapping[例外マッピング] で述べたようにアプリケーションで処理されない場合、デフォルトでHTTP 400レスポンスが返されます。

source: As part of reading the multipart body, RESTEasy Reactive invokes the proper MessageBodyReaderlink:{jaxrsapi}/javax/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] for each part of the request. If an `IOException` occurs for one of these parts (for example if Jackson was unable to deserialize a JSON part), then a `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` is thrown. If this exception is not handled by the application as mentioned in <<exception-mapping>>, an HTTP 400 response is returned by default.
ja_jp: マルチパートボディの読み取りの一環として、RESTEasy Reactive はリクエストの各部分に対して適切な link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] を呼び出します。これらのパーツのいずれかで `IOException` が発生した場合 (たとえば、Jackson が JSON パーツをデシリアライズできなかった場合)、 `org.jboss.resteasy.reactive.server.multipart.MultipartPartReadingException` が出力されます。 <<exception-mapping>> で説明したように、この例外がアプリケーションによって処理されない場合、HTTP 400 応答がデフォルトで返されます。

source: As part of the custom branding, you can supply your own logo to replace the Quarkus logo. For example, let's say you own a company that makes everything, ACME, and you are using REST Services for your online store, and wants to brand the Swagger UI Page:
ja_jp: カスタムブランディングの一環として、Quarkusのロゴの代わりに独自のロゴを付与することができます。例えば、なんでも屋のACMEという会社を経営していて、オンラインストアにRESTサービスを利用していて、Swagger UIページをブランディングしたいとします:

source: As per MicroProfile Telemetry Tracing specification, Quarkus supports the CDI injections of the following classes:
ja_jp: MicroProfile Telemetry Tracing の仕様に基づき、Quarkus は以下のクラスの CDI 依存関係注入 をサポートしています。

source: As per the above configuration, the PostgreSQL container port `5432` will be exposed to a random host port and the application datasource will be configured by extracting connection information such as _user_, _password_, and the _database name_.
ja_jp: 上記の構成に従って、PostgreSQL コンテナーポート `5432` はランダムなホストポートに公開され、アプリケーションデータソースは _ユーザー_、_パスワード_、_データベース名_ などの接続情報を抽出することによって構成されます。

source: As previously mentioned, the body parameter needs to be properly crafted by the application code to conform to the service's requirements.
ja_jp: 前述したように、サービスの要件に準拠するには、アプリケーションコードによって body パラメーターを適切に作成する必要があります。

source: As previously presented, Quarkus 2.0 is in the continuity of Quarkus 1.x and won't require too many changes on your side. But we consider it a major release as major parts of our infrastructure have changed:
ja_jp: 以前に紹介したように、Quarkus 2.0はQuarkus 1.xの連続性の中にあり、ユーザー側ではあまり多くの変更を必要としません。しかし、インフラの主要部分が変更されたため、メジャーリリースと考えています。

source: As previously stated, most of the time, this automatic resolution will suit you and you won't need to configure the driver.
ja_jp: 前述したように、多くの場合、この自動解像度が適切で、ドライバーを設定する必要はありません。

source: As said above, `invoke` is synchronous. Mutiny invokes the callback and propagates the event downstream when the callback returns. It blocks the dispatching.
ja_jp: 上で述べたように、 `invoke` は同期です。Mutinyはコールバックを呼び出し、コールバックが戻ってきたらイベントを下流に伝播させます。ディスパッチをブロックします。

source: As said above, this mechanism is based on the Vert.x event bus. So, you can also use `Message` directly:
ja_jp: 先述のように、この仕組みは Vert.x イベントバスをベースにしているため、直接 `Message` を使うこともできます。

source: As said above, we will use Reactive Messaging. When you use Reactive Messaging, you send messages to a channel and receive them from another channel. These channels are mapped to the underlying messaging technology by configuration. In our application, we must indicate that our reception and publication channels will use the __movies__ Kafka channel. In `src/main/resources/application.properties`, add the following content:
ja_jp: 上記の通り、Reactive Messagingを使用します。Reactive Messagingを使用する場合、あるチャンネルにメッセージを送信し、別のチャンネルからメッセージを受信します。これらのチャンネルは、基礎となるメッセージング技術に設定によってマッピングされます。このアプリケーションでは、受信および配信チャンネルが _movies_ Kafkaチャンネルを使用することを指定する必要があります。 `src/main/resources/application.properties` で、以下の内容を追加します:

source: As said above, we will use Reactive Messaging. When you use Reactive Messaging, you send messages to a channel and receive them from another channel. These channels are mapped to the underlying messaging technology by configuration. We must indicate that our reception and publication channels will use the __movies__ address in our application. In `src/main/resources/application.properties`, add the following content:
ja_jp: 上記の通り、Reactive Messagingを使用します。リアクティブメッセージングを使用する場合、あるチャンネルにメッセージを送信し、別のチャンネルからメッセージを受信します。これらのチャンネルは、設定によって基礎となるメッセージング技術にマッピングされます。受信および公開チャンネルがアプリケーションで __movies__ アドレスを使用することを示す必要があります。 `src/main/resources/application.properties` で、次の内容を追加します:

source: As shown in the <<developing-with-flyway>> section, to start using Flyway with your project, you just need to:
ja_jp: <<developing-with-flyway>> で示されているように、プロジェクトで Flyway を使い始めるには、以下のことを行う必要があります:

source: As shown in the architecture above, the Kubernetes rest-service is backed by two pods. While classic Kubernetes service discovery would ensure that requests to the rest-service are load-balanced across these two pods, Stork retrieves the pods' addresses directly. Thus it can handle the service selection (using a round-robin for now).
ja_jp: 上記のアーキテクチャに示すように、Kubernetesのrest-serviceは2つのポッドによって支えられています。従来のKubernetesのサービスディスカバリーでは、rest-serviceへのリクエストがこの2つのポッドに負荷分散されるようになっていましたが、Storkはポッドのアドレスを直接取得します。これにより、サービスの選択を行うことができます（現在はラウンドロビンを使用しています）。

source: As shown in the previous section, a profile for an operation can be defined using an `@Extension`. Operations are filtered into documents based on their profiles:
ja_jp: 前のセクションで示したように、オペレーションのプロファイルは `@Extension` を使用して定義できます。オペレーションは、そのプロファイルに基づいてドキュメントにフィルタリングされます。

source: As shown in the xref:developing-with-flyway[Developing with Flyway] section, to start using Flyway with your project, you just need to:
ja_jp: xref:developing-with-flyway[Flyway を使った開発] セクションで示したように、プロジェクトで Flyway を使い始めるには、次のことが必要です:

source: As specified above this is optional.
ja_jp: 上述の通り、これはオプションです。

source: As stated above, Quarkus provides the option of using JSON-B instead of Jackson via the use of the `quarkus-resteasy-jsonb` extension.
ja_jp: 上記のように、 Quarkus では、 `quarkus-resteasy-jsonb` エクステンションを使用することで、 Jackson の代わりに JSON-B を使用するオプションを提供しています。

source: As stated above, we are using the DataStax Object Mapper. In other words, we are not going to write our CQL queries manually; instead, we will annotate our data model with a few annotations, and the mapper will generate proper CQL queries underneath.
ja_jp: 前述のとおり、ここではDataStax Object Mapperを使用しています。つまり、CQLクエリーを手動で記述するのではなく、データ・モデルにいくつかのアノテーションを付け、裏側でマッパーが適切なCQLクエリーを生成するのです。

source: As suggested by the message, let's start by adding an option to track object instantiation:
ja_jp: メッセージにあるように、まずはオブジェクトのインスタンス化を追跡するためのオプションを追加してみましょう。

source: As the Vert.x API is asynchronous, our method returns a `Uni`. The content is written into the HTTP response when the asynchronous operation represented by the Uni completes.
ja_jp: Vert.x APIは非同期なので、このメソッドは `Uni` を返却します。Uniで表される非同期操作が完了すると、その内容がHTTPレスポンスに書き込まれます。

source: As the `acme` extension is experimental, we'll include `\{includes}/extension-status.adoc` that provides extension status text. It uses the extension status attribute defined in the header.
ja_jp: `acme` エクステンションは実験的なものであるため、エクステンションのステータステキストを提供する `\{includes}/extension-status.adoc` を含めます。これは、ヘッダーで定義されているエクステンションステータス属性を使用しています。

source: As the `start` method returns configuration that applies for tests, we set the `quarkus.oauth2.introspection-url` property that controls the URL of the introspect endpoint used by the OAuth2 extension.
ja_jp: `start` メソッドはテストに適用される設定を返すので、OAuth2 エクステンションで使用する introspect エンドポイントの URL を制御する `quarkus.oauth2.introspection-url` プロパティーを設定します。

source: As the `start` method returns configuration that applies for tests, we set the rest-client property that controls the base URL which is used by the implementation of `ExtensionsService` to the base URL where Wiremock is listening for incoming requests.
ja_jp: `start` メソッドはテストに適用される設定を返すので、 `ExtensionsResource` の実装で使用されるベース URL を制御する rest-client プロパティーを、 Wiremock がリクエストの着信をリッスンするベース URL に設定します。

source: As the application runs in _dev mode_, it simulates the sending of the emails. It prints it in the log, so you can check that what was about to be sent.
ja_jp: このアプリケーションは _devモード_ で動作しているので、メール送信のシミュレーションを行います。それをログに出力するので、何が送信されようとしているのかを確認することができます。

source: As the configuration of the service could be missing, we need to use `Instance<ServiceConfiguration>` as type at the injection point.
ja_jp: サービス設定が欠落している可能性があるため、インジェクションポイントで `Instance<ServiceConfiguration>` を型として使用する必要があります。

source: As the goal of this guide is to show how to use Stork Kubernetes service discovery, we won't provide the specifics steps for the Red and Blue services. Their container images are already built and available in a public registry:
ja_jp: このガイドの目的は Stork Kubernetes サービス検出の使用方法を示すことであるため、Red および Blue サービスに関する具体的な手順は説明しません。コンテナーイメージはすでにビルドされており、パブリックレジストリーで利用可能です。

source: As the https://www.graphql.org/[GraphQL] specification website states:
ja_jp: link:https://www.graphql.org/[GraphQL] の仕様のWebサイトにも記載されているように

source: As the injected instance is not available here we use `installMockForType`, this mock is used for both test methods
ja_jp: インジェクションされたインスタンスはここでは利用できないので、 `installMockForType` を使用します。このモックは両方のテストメソッドに使用されます。

source: As the list of commands which are supported out-of-box by both https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] and https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] depends on what is available in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`], then there might be case when you need a command which is not (yet) available via https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`].
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`]と link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`]の両方でサポートされているコマンドのリストは link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`]で利用可能なものに依存するため、場合によっては link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] で利用できないコマンドが必要になる場合があります。

source: As the load balancer of Docker Compose will distribute requests to the `aggregator` service in a round-robin fashion, we'll invoke the actual nodes directly. The application exposes information about all the host names via REST:
ja_jp: Docker Composeのロードバランサーがラウンドロビン方式で `aggregator` サービスにリクエストを配信するので、実際のノードを直接呼び出すことにします。アプリケーションはREST経由ですべてのホスト名の情報を公開しています。

source: As there is nothing but a `.java` file, most IDE's don't handle content assist well. To work around that you can run `jbang edit quarkusapp.java`, this will print out a directory that will have a temporary project setup you can use in your IDE.
ja_jp: `.java` ファイルしかないので、ほとんどの IDE はコンテンツアシストをうまく処理できません。これを回避するには、 `jbang edit quarkusapp.java` を実行すると、IDE で使用できる一時的なプロジェクトの設定があるディレクトリーが出力されます。

source: As these proliferated, we started worrying about link:https://groups.google.com/g/quarkus-dev/c/FMnmlDIcGRY[polluting the application endpoint namespace], and thinking about how we could group these non-application endpoints together to avoid colliding with application endpoints and make it easier to deal with security and access policies. Some users further asked if we could serve these non-application endpoints from link:https://github.com/quarkusio/quarkus/issues/13602[another port entirely] (we haven't gotten there yet).
ja_jp: そして、 link:https://groups.google.com/g/quarkus-dev/c/FMnmlDIcGRY[アプリケーションエンドポイント]との衝突を避け、セキュリティやアクセスポリシーの処理を容易にするために、アプリケーション以外のエンドポイントをどのようにグループ化するかを考え始めました。さらに何人かのユーザからは、これらの非アプリケーションエンドポイントを link:https://github.com/quarkusio/quarkus/issues/13602[完全に別のポートから提供できないか]という意見もありました (まだ実現していません)。

source: As they cannot be instantiated, they cannot be injected by any means, nor be returned by a build step (or via a `BuildProducer`). To produce an empty build item you must annotate the build step with `@Produce(MyEmptyBuildItem.class)` and to consume it by `@Consume(MyEmptyBuildItem.class)`.
ja_jp: それらはインスタンス化できないため、いかなる方法でも注入することも、ビルドステップ (または `BuildProducer` を介して) によって返すこともできません。 空のビルド アイテムを生成するには、ビルド ステップに `@Produce(MyEmptyBuildItem.class)` でアノテーションを付け、それを `@Consume(MyEmptyBuildItem.class)` で消費する必要があります。

source: As this packaging format is new, we hope to gather feedback from real-world usage.
ja_jp: このパッケージング形式は新しいものであるため、実際の使用状況からフィードバックを収集したいと考えています。

source: As this resource does not return a single instance of type `Record`, the links for the methods `get`, `update`, and `delete` are not injected. Now, when calling the endpoint `/records/1`, you would get the following web links:
ja_jp: このリソースは型 `Record` の単一のインスタンスを返さないため、メソッド `get`、 `update`、および `delete` のリンクは挿入されません。これで、エンドポイント `/records/1` を呼び出すと、次の Web リンクが表示されます。

source: As this sets a system property you can access `quarkus.http.port` via MicroProfile Config, however if you use injection the injected value may not always be correct. This port allocation is one of the last things to happen in Quarkus startup, so if your object that is being injected is created eagerly before the port has opened the injected value will not be correct.
ja_jp: これはシステムプロパティを設定するものなので、MicroProfile Config から `quarkus.http.port` にアクセスできます。ただし、インジェクションを使用した場合は、注入された値が常に正しいとは限りません。このポート割り当ては、Quarkus の起動時に最後に起こることの 1 つなので、インジェクションされるオブジェクトがポートが開く前にしきりに作成された場合、インジェクションされた値は正しくなりません。

source: As usual with native executable compilation, this operation consumes a lot of memory.
ja_jp: ネイティブ実行可能ファイルのコンパイルと同様に、この操作は大量のメモリーを消費します。

source: As usual, Quarkus further simplifies things under the hood when running your application as a native executable.
ja_jp: いつものように、 Quarkus は、アプリケーションをネイティブ実行可能ファイルとして実行する際に、内部の作業をさらに簡略化しています。

source: As usual, along the path Quarkus simplifies things under the hood (Maven Mojo, bytecode generation or testing) to make it pleasant to develop new features.
ja_jp: いつものように、Quarkus は地道に、新機能の開発を快適にするために、Maven Mojo、バイトコード生成またはテストといった作業を簡素化するために努めています。

source: As usual, along the path, Quarkus simplifies things under the hood (Maven Mojo, bytecode generation, or testing) to make it pleasant to develop new features.
ja_jp: いつものように、Quarkus は、新しい機能を楽しく開発できるように、舞台裏で物事を簡素化しています (Maven Mojo、バイトコード生成、テストなど)。

source: As usual, defining a servlet requires to extend `jakarta.servlet.http.HttpServlet`.
ja_jp: 例によって、サーブレットを定義するには、 `jakarta.servlet.http.HttpServlet` を拡張する必要があります。

source: As usual, defining a servlet requires to extend `javax.servlet.http.HttpServlet`.
ja_jp: 通常通り、サーブレットを定義するには `javax.servlet.http.HttpServlet` の拡張が必要です。

source: As usual, it also comes with documentation refinements.
ja_jp: いつものように、ドキュメントの改善も施されています。

source: As usual, it also comes with its fair share of bugfixes and usability and documentation improvements.
ja_jp: いつものように、バグ修正や使い勝手の改善、ドキュメントの改善なども行われています。

source: As usual, the application can be packaged using:
ja_jp: いつものように、アプリケーションは以下の方法でパッケージ化されます。

source: As usual, the documentation also got some love during this release cycle.
ja_jp: 今回のリリースサイクルでは、これまで同様、ドキュメントにも手を入れました。

source: As usual, this release also includes many bug fixes, including fixes for some https://github.com/quarkusio/quarkus/pull/51891[very old issues created in 2020], thanks to our amazing community!
ja_jp: いつものように、このリリースには、素晴らしいコミュニティーのおかげで、 link:https://github.com/quarkusio/quarkus/pull/51891[2020年に作成された非常に古い問題] の修正を含む、多くのバグ修正も含まれています！

source: As usual, this release fixes bugs and includes some documentation improvements but it also introduces a new extension for the Oracle JDBC driver.
ja_jp: 今回のリリースでは、通常通り、バグの修正とドキュメントの改善が行われていますが、それに加えて、Oracle JDBCドライバ用の新しいエクステンションが導入されています。

source: As usual, this version comes with new security features and enhancements:
ja_jp: いつものように、このバージョンには新しいセキュリティ機能と機能強化が含まれています。
